In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

# show start of df
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [2]:
# show end of df
school_data_complete.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [3]:
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [4]:
#school_data_complete['school_name'] = school_data_complete['school_name'].astype('|S80')

In [5]:
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [6]:
school_data_complete.describe

<bound method NDFrame.describe of        Student ID       student_name gender grade         school_name  \
0               0       Paul Bradley      M   9th   Huang High School
1               1       Victor Smith      M  12th   Huang High School
2               2    Kevin Rodriguez      M  12th   Huang High School
3               3  Dr. Richard Scott      M  12th   Huang High School
4               4         Bonnie Ray      F   9th   Huang High School
...           ...                ...    ...   ...                 ...
39165       39165       Donna Howard      F  12th  Thomas High School
39166       39166          Dawn Bell      F  10th  Thomas High School
39167       39167     Rebecca Tanner      F   9th  Thomas High School
39168       39168       Desiree Kidd      F  10th  Thomas High School
39169       39169    Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget
0                 66          79          0  District  2917  1910635
1                 94          61          0  District  2917  1910635
2                 90          60          0  District  2917  1910635
3                 67          58          0  District  2917  1910635
4                 97          84          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

[39170 rows x 11 columns]>

In [7]:
# check for incomplete columns
count = school_data_complete.count()
count

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [8]:
# find count of schools
total_schools = len(school_data_complete["school_name"].unique())
total_schools

15

In [9]:
# find total count of students

total_students = school_data_complete["student_name"].count()
total_students

39170

In [10]:
# find district budget
total_school_budget = school_data_complete["budget"].unique()
pd.to_numeric(total_school_budget)
total_school_budget = np.sum(total_school_budget)
total_school_budget = "${:.0f}".format(total_school_budget)

total_school_budget

'$24649428'

In [11]:
# find district average math score
average_math_score = school_data_complete["math_score"].mean()

average_math_score = '{:,.2f}'.format(average_math_score)
average_math_score

'78.99'

In [12]:
# find district average reading score
average_reading_score = school_data_complete["reading_score"].mean()

average_reading_score = '{:,.2f}'.format(average_reading_score)
average_reading_score

'81.88'

In [13]:
# find disrtict passing math percentage
passing_math = (len(school_data_complete[school_data_complete["math_score"] >= 70]))/total_students
#passing_math_per = (len(school_data_complete[school_data_complete["math_score"] >= 70]))/total_students

passing_math_per= "{0:.2%}".format(passing_math)
passing_math_per

'74.98%'

In [14]:
# find district passing reading percentage
passing_reading = (len(school_data_complete[school_data_complete["reading_score"] >= 70]))/total_students
#passing_reading_per = (len(school_data_complete[school_data_complete["reading_score"] >= 70]))/total_students

passing_reading_per = "{0:.2%}".format(passing_reading)
passing_reading_per

'85.81%'

In [15]:
# find overall average of math and reading percentages
overall_passing_rate = (passing_math + passing_reading) / 2

overall_passing_rate_per = "{0:.2%}".format(overall_passing_rate)
overall_passing_rate_per

'80.39%'

In [16]:
# create district summary table
district_summary_df = pd.DataFrame({"Total Schools":[total_schools],
                                    "Total Students":[total_students],
                                    "Total Budget":[total_school_budget],
                                    "Average Math Score":[average_math_score],
                                    "Average Reading Score": [average_reading_score],
                                    "Passing Math":[passing_math_per],
                                    "Passing Reading":[passing_reading_per],
                                    "Overall Passing Rate":[overall_passing_rate_per]})
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing Rate
0,15,39170,$24649428,78.99,81.88,74.98%,85.81%,80.39%

In [17]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [18]:
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [19]:
school_summary = school_data_complete[["school_name","type"]]
school_summary

              school_name      type
0       Huang High School  District
1       Huang High School  District
2       Huang High School  District
3       Huang High School  District
4       Huang High School  District
...                   ...       ...
39165  Thomas High School   Charter
39166  Thomas High School   Charter
39167  Thomas High School   Charter
39168  Thomas High School   Charter
39169  Thomas High School   Charter

[39170 rows x 2 columns]

In [20]:
school_summary = school_summary.drop_duplicates()
school_summary

                 school_name      type
0          Huang High School  District
2917    Figueroa High School  District
5866     Shelton High School   Charter
7627   Hernandez High School  District
12262    Griffin High School   Charter
13730     Wilson High School   Charter
16013    Cabrera High School   Charter
17871     Bailey High School  District
22847     Holden High School   Charter
23274       Pena High School   Charter
24236     Wright High School   Charter
26036  Rodriguez High School  District
30035    Johnson High School  District
34796       Ford High School  District
37535     Thomas High School   Charter

In [21]:
school_summary.dtypes

school_name    object
type           object
dtype: object

In [22]:
#school_summary_s = school_summary.astype(str)
#school_summary_s

In [23]:
school_summary.dtypes

school_name    object
type           object
dtype: object

In [24]:
#school_summary.rename(columns={["school_name"]:"School Name", ["type"]:"Type"},inplace=True)
#school_summary

In [25]:
# create beginning of new school summary dataframe pulling school name and type
#school_summary_df = school_data_complete.iloc[:,[4,8]]
#school_summary_df.head()

In [27]:
#school_summary_df.rename(columns={"school_name":"School Name", "type":"Type"}, inplace=True)
#school_summary_df

In [ ]:
# drop index in dataframe
school_summary_df = school_summary_df.set_index("School Name", inplace=True)
school_summary_df

In [ ]:
#school_summary = pd.DataFrame({school_data_complete['School Name'], school_data_complete['Type']})
##school_summary = school_summary.set_index('School Name')
#school_summary = school_summary.drop_duplicates(subset=['School Name'])
#school_summary

In [ ]:
#################format_mapping={'Per Student Budget': '${:,.2f}'}

In [28]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [29]:
school_summary

                 school_name      type
0          Huang High School  District
2917    Figueroa High School  District
5866     Shelton High School   Charter
7627   Hernandez High School  District
12262    Griffin High School   Charter
13730     Wilson High School   Charter
16013    Cabrera High School   Charter
17871     Bailey High School  District
22847     Holden High School   Charter
23274       Pena High School   Charter
24236     Wright High School   Charter
26036  Rodriguez High School  District
30035    Johnson High School  District
34796       Ford High School  District
37535     Thomas High School   Charter

In [39]:
total_students = school_data_complete.groupby(['school_name'])['size'].size()
school_summary['Total Students'] = total_students
school_summary
#total_students

C:\Users\jener\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

                 school_name      type  Total Students
0          Huang High School  District             NaN
2917    Figueroa High School  District             NaN
5866     Shelton High School   Charter             NaN
7627   Hernandez High School  District             NaN
12262    Griffin High School   Charter             NaN
13730     Wilson High School   Charter             NaN
16013    Cabrera High School   Charter             NaN
17871     Bailey High School  District             NaN
22847     Holden High School   Charter             NaN
23274       Pena High School   Charter             NaN
24236     Wright High School   Charter             NaN
26036  Rodriguez High School  District             NaN
30035    Johnson High School  District             NaN
34796       Ford High School  District             NaN
37535     Thomas High School   Charter             NaN

In [41]:
total_school_budget = school_data_complete.groupby(['school_name'])['budget'].unique()
school_summary["Total School Budget"] = total_school_budget
school_summary.head()

C:\Users\jener\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

                 school_name      type  Total Students Total School Budget
0          Huang High School  District             NaN                 NaN
2917    Figueroa High School  District             NaN                 NaN
5866     Shelton High School   Charter             NaN                 NaN
7627   Hernandez High School  District             NaN                 NaN
12262    Griffin High School   Charter             NaN                 NaN

In [42]:
per_student_budget = total_school_budget / total_students
school_summary["Per Student Budget"] = (per_student_budget)
#school_summary["Per Student Budget"] = school_summary["Per Student Budget"].map("${:,.2f}".format
school_summary.head()
# -----------------map("${:,.2f}".format.

C:\Users\jener\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,school_name,type,Total Students,Total School Budget,Per Student Budget
0,Huang High School,District,NaN,NaN,NaN
2917,Figueroa High School,District,NaN,NaN,NaN
5866,Shelton High School,Charter,NaN,NaN,NaN
7627,Hernandez High School,District,NaN,NaN,NaN
12262,Griffin High School,Charter,NaN,NaN,NaN

In [43]:
# pull number of students in each school
student_counts = school_data_complete["school_name"].value_counts()
student_counts.head()

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Name: school_name, dtype: int64

In [44]:
# groupby math scores for each school
math_score = school_data_complete.groupby(['school_name'])['math_score'].sum()
math_score

school_name
Bailey High School       383393
Cabrera High School      154329
Figueroa High School     226223
Ford High School         211184
Griffin High School      122360
Hernandez High School    358238
Holden High School        35784
Huang High School        223528
Johnson High School      366942
Pena High School          80654
Rodriguez High School    307294
Shelton High School      146796
Thomas High School       136389
Wilson High School       190115
Wright High School       150628
Name: math_score, dtype: int64

In [45]:
# groupby reading scores for each school
reading_score = school_data_complete.groupby(['school_name'])['reading_score'].sum()
reading_score

school_name
Bailey High School       403225
Cabrera High School      156027
Figueroa High School     239335
Ford High School         221164
Griffin High School      123043
Hernandez High School    375131
Holden High School        35789
Huang High School        236810
Johnson High School      385481
Pena High School          80851
Rodriguez High School    322898
Shelton High School      147441
Thomas High School       137093
Wilson High School       191748
Wright High School       151119
Name: reading_score, dtype: int64

In [46]:
# create table to hold scores for calculations
score_table = pd.DataFrame({"Students in School": student_counts,
                            "Math Scores": math_score,
                            "Reading Scores": reading_score})
score_table.head()

                      Students in School  Math Scores  Reading Scores
Bailey High School                  4976       383393          403225
Cabrera High School                 1858       154329          156027
Figueroa High School                2949       226223          239335
Ford High School                    2739       211184          221164
Griffin High School                 1468       122360          123043

In [47]:
# create and calculating columns in table
school_summary['Average Math Score'] = score_table["Math Scores"]/score_table["Students in School"]
school_summary['Average Math Score'] = school_summary['Average Math Score'].map("{:,.2f}".format)
school_summary['Average Reading Score'] = score_table["Reading Scores"]/score_table["Students in School"]
school_summary['Average Reading Score'] = school_summary['Average Reading Score'].map("{:,.2f}".format)
school_summary.head()

C:\Users\jener\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\jener\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\jener\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\jener\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

,school_name,type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score
0,Huang High School,District,NaN,NaN,NaN,nan,nan
2917,Figueroa High School,District,NaN,NaN,NaN,nan,nan
5866,Shelton High School,Charter,NaN,NaN,NaN,nan,nan
7627,Hernandez High School,District,NaN,NaN,NaN,nan,nan
12262,Griffin High School,Charter,NaN,NaN,NaN,nan,nan

In [ ]:
# students passing math with score of 70 or greater
passing_math_70 = school_data_complete[school_data_complete["math_score"] >= 70]
passing_math_70.head()

In [ ]:
# group schools with student number passing math
passing_math = passing_math_70.groupby(['school_name'])['math_score'].size()
passing_math

In [ ]:
# students passing reading with score of 70 or greater
passing_reading_70 = school_data_complete[school_data_complete["reading_score"] >= 70]
passing_reading_70.head()

In [ ]:
# group schools with school number passing reading
passing_reading = passing_reading_70.groupby(['school_name'])['reading_score'].size()
passing_reading

In [ ]:
# df for calculations for school summary
passing_df = pd.DataFrame({"Total Students":student_counts,
                           "Passing Math": passing_math,
                           "Passing Reading":passing_reading})
passing_df

In [ ]:
percent_passing_math = passing_df['Passing Math'] / total_students
percent_passing_reading = passing_df['Passing Reading'] / total_students
percent_passing_math

In [ ]:
school_data_complete.head()

In [ ]:
# create and clean new summary datafram
school_summary = pd.DataFrame({"School Type": school_type,
                               "Total Students": total_students,
                               "Total School Budget": total_school_budget,
                               "Per Student Budget" : per_student_budget,
                               "Average Math Score" : average_math_score,
                               "Average Reading Score" : average_reading_score,
                               'Passing Math' : passing_math,
                               'Passing Reading' : passing_reading,
                               'Overall Passing Rate' : overall_passing_rate})
school_summary